<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"90cf923d79f10b2a65efb77704608f31b438aef598acb8356c36c55c087f4462","plan_job_ref":"Job PR Plan #11 at https://github.com/JunzhongLin/johndemo3/actions/runs/13005288473","plan_out_hash":"e662c18db44d7115fc71627a2776d670ef9b819e06942ec45fe0bb060d066d17","plan_hash":"be14021ace8057af4f67fba64ec993adcf0bcdb164c7f0c4fa605d9b561e68dd","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __terraform__
With backend config files: `terraform/conf/dev.backend.conf`
With var files: `terraform/variables/common.tfvars
terraform/variables/dev.tfvars
`
<details>
<summary>Plan: 7 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # azurerm_resource_group.rg will be created
+   resource "azurerm_resource_group" "rg" {
+       id       = (known after apply)
+       location = "northeurope"
+       name     = "coop-demo3-rg-dev"
    }

  # module.event_grid.azurerm_eventgrid_topic.event_topic will be created
+   resource "azurerm_eventgrid_topic" "event_topic" {
+       endpoint                      = (known after apply)
+       id                            = (known after apply)
+       input_schema                  = "EventGridSchema"
+       local_auth_enabled            = true
+       location                      = "northeurope"
+       name                          = "topic-johndemo3"
+       primary_access_key            = (sensitive value)
+       public_network_access_enabled = true
+       resource_group_name           = "coop-demo3-rg-dev"
+       secondary_access_key          = (sensitive value)
    }

  # module.function.azurerm_application_insights.logging will be created
+   resource "azurerm_application_insights" "logging" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "northeurope"
+       name                                = "logging-function-johndemo3-johndemo3"
+       resource_group_name                 = "coop-demo3-rg-dev"
+       retention_in_days                   = 30
+       sampling_percentage                 = 100
+       tags                                = {
+           "repo_name" = "johndemo3"
        }
    }

  # module.function.azurerm_function_app.ml_model will be created
+   resource "azurerm_function_app" "ml_model" {
+       app_service_plan_id             = (known after apply)
+       app_settings                    = (known after apply)
+       custom_domain_verification_id   = (known after apply)
+       default_hostname                = (known after apply)
+       enable_builtin_logging          = true
+       enabled                         = true
+       https_only                      = false
+       id                              = (known after apply)
+       key_vault_reference_identity_id = (known after apply)
+       kind                            = (known after apply)
+       location                        = "northeurope"
+       name                            = "function-johndemo3"
+       outbound_ip_addresses           = (known after apply)
+       possible_outbound_ip_addresses  = (known after apply)
+       resource_group_name             = "coop-demo3-rg-dev"
+       site_credential                 = (known after apply)
+       storage_account_access_key      = (sensitive value)
+       storage_account_name            = "johndemo3dev"
+       tags                            = {
+           "repo_name" = "johndemo3"
        }
+       version                         = "~3"

+       auth_settings (known after apply)

+       connection_string (known after apply)

+       site_config (known after apply)

+       source_control (known after apply)
    }

  # module.function.azurerm_service_plan.func_service_plan will be created
+   resource "azurerm_service_plan" "func_service_plan" {
+       id                           = (known after apply)
+       kind                         = (known after apply)
+       location                     = "northeurope"
+       maximum_elastic_worker_count = (known after apply)
+       name                         = "function_service_plan-johndemo3"
+       os_type                      = "Linux"
+       per_site_scaling_enabled     = false
+       reserved                     = (known after apply)
+       resource_group_name          = "coop-demo3-rg-dev"
+       sku_name                     = "B1"
+       worker_count                 = (known after apply)
    }

  # module.storage_account.azurerm_storage_account.demo3_storage will be created
+   resource "azurerm_storage_account" "demo3_storage" {
+       access_tier                        = (known after apply)
+       account_kind                       = "StorageV2"
+       account_replication_type           = "LRS"
+       account_tier                       = "Standard"
+       allow_nested_items_to_be_public    = true
+       cross_tenant_replication_enabled   = false
+       default_to_oauth_authentication    = false
+       dns_endpoint_type                  = "Standard"
+       https_traffic_only_enabled         = true
+       id                                 = (known after apply)
+       infrastructure_encryption_enabled  = false
+       is_hns_enabled                     = false
+       large_file_share_enabled           = (known after apply)
+       local_user_enabled                 = true
+       location                           = "northeurope"
+       min_tls_version                    = "TLS1_2"
+       name                               = "johndemo3dev"
+       nfsv3_enabled                      = false
+       primary_access_key                 = (sensitive value)
+       primary_blob_connection_string     = (sensitive value)
+       primary_blob_endpoint              = (known after apply)
+       primary_blob_host                  = (known after apply)
+       primary_blob_internet_endpoint     = (known after apply)
+       primary_blob_internet_host         = (known after apply)
+       primary_blob_microsoft_endpoint    = (known after apply)
+       primary_blob_microsoft_host        = (known after apply)
+       primary_connection_string          = (sensitive value)
+       primary_dfs_endpoint               = (known after apply)
+       primary_dfs_host                   = (known after apply)
+       primary_dfs_internet_endpoint      = (known after apply)
+       primary_dfs_internet_host          = (known after apply)
+       primary_dfs_microsoft_endpoint     = (known after apply)
+       primary_dfs_microsoft_host         = (known after apply)
+       primary_file_endpoint              = (known after apply)
+       primary_file_host                  = (known after apply)
+       primary_file_internet_endpoint     = (known after apply)
+       primary_file_internet_host         = (known after apply)
+       primary_file_microsoft_endpoint    = (known after apply)
+       primary_file_microsoft_host        = (known after apply)
+       primary_location                   = (known after apply)
+       primary_queue_endpoint             = (known after apply)
+       primary_queue_host                 = (known after apply)
+       primary_queue_microsoft_endpoint   = (known after apply)
+       primary_queue_microsoft_host       = (known after apply)
+       primary_table_endpoint             = (known after apply)
+       primary_table_host                 = (known after apply)
+       primary_table_microsoft_endpoint   = (known after apply)
+       primary_table_microsoft_host       = (known after apply)
+       primary_web_endpoint               = (known after apply)
+       primary_web_host                   = (known after apply)
+       primary_web_internet_endpoint      = (known after apply)
+       primary_web_internet_host          = (known after apply)
+       primary_web_microsoft_endpoint     = (known after apply)
+       primary_web_microsoft_host         = (known after apply)
+       public_network_access_enabled      = true
+       queue_encryption_key_type          = "*******"
+       resource_group_name                = "coop-demo3-rg-dev"
+       secondary_access_key               = (sensitive value)
+       secondary_blob_connection_string   = (sensitive value)
+       secondary_blob_endpoint            = (known after apply)
+       secondary_blob_host                = (known after apply)
+       secondary_blob_internet_endpoint   = (known after apply)
+       secondary_blob_internet_host       = (known after apply)
+       secondary_blob_microsoft_endpoint  = (known after apply)
+       secondary_blob_microsoft_host      = (known after apply)
+       secondary_connection_string        = (sensitive value)
+       secondary_dfs_endpoint             = (known after apply)
+       secondary_dfs_host                 = (known after apply)
+       secondary_dfs_internet_endpoint    = (known after apply)
+       secondary_dfs_internet_host        = (known after apply)
+       secondary_dfs_microsoft_endpoint   = (known after apply)
+       secondary_dfs_microsoft_host       = (known after apply)
+       secondary_file_endpoint            = (known after apply)
+       secondary_file_host                = (known after apply)
+       secondary_file_internet_endpoint   = (known after apply)
+       secondary_file_internet_host       = (known after apply)
+       secondary_file_microsoft_endpoint  = (known after apply)
+       secondary_file_microsoft_host      = (known after apply)
+       secondary_location                 = (known after apply)
+       secondary_queue_endpoint           = (known after apply)
+       secondary_queue_host               = (known after apply)
+       secondary_queue_microsoft_endpoint = (known after apply)
+       secondary_queue_microsoft_host     = (known after apply)
+       secondary_table_endpoint           = (known after apply)
+       secondary_table_host               = (known after apply)
+       secondary_table_microsoft_endpoint = (known after apply)
+       secondary_table_microsoft_host     = (known after apply)
+       secondary_web_endpoint             = (known after apply)
+       secondary_web_host                 = (known after apply)
+       secondary_web_internet_endpoint    = (known after apply)
+       secondary_web_internet_host        = (known after apply)
+       secondary_web_microsoft_endpoint   = (known after apply)
+       secondary_web_microsoft_host       = (known after apply)
+       sftp_enabled                       = false
+       shared_access_key_enabled          = true
+       table_encryption_key_type          = "*******"
+       tags                               = {
+           "environment" = "dev"
        }

+       blob_properties (known after apply)

+       network_rules (known after apply)

+       queue_properties (known after apply)

+       routing (known after apply)

+       share_properties (known after apply)
    }

  # module.storage_account.azurerm_storage_container.image_input will be created
+   resource "azurerm_storage_container" "image_input" {
+       container_access_type             = "private"
+       default_encryption_scope          = (known after apply)
+       encryption_scope_override_enabled = true
+       has_immutability_policy           = (known after apply)
+       has_legal_hold                    = (known after apply)
+       id                                = (known after apply)
+       metadata                          = (known after apply)
+       name                              = "johndemo3-input-image-container-dev"
+       resource_manager_id               = (known after apply)
+       storage_account_name              = "johndemo3dev"
    }

  # module.stroage_account.azurerm_storage_account.example will be destroyed
  # (because azurerm_storage_account.example is not in configuration)
-   resource "azurerm_storage_account" "example" {
-       access_tier                       = "Hot" -> null
-       account_kind                      = "StorageV2" -> null
-       account_replication_type          = "LRS" -> null
-       account_tier                      = "Standard" -> null
-       allow_nested_items_to_be_public   = true -> null
-       cross_tenant_replication_enabled  = true -> null
-       id                                = "/subscriptions/bd4b7a52-3576-4e08-81b6-fdbe7146cb7f/resourceGroups/coop-rg/providers/Microsoft.Storage/storageAccounts/johnlinexample3dev" -> null
-       infrastructure_encryption_enabled = false -> null
-       is_hns_enabled                    = false -> null
-       location                          = "northeurope" -> null
-       min_tls_version                   = "TLS1_2" -> null
-       name                              = "johnlinexample3dev" -> null
-       nfsv3_enabled                     = false -> null
-       primary_access_key                = (sensitive value) -> null
-       primary_blob_connection_string    = (sensitive value) -> null
-       primary_blob_endpoint             = "https://johnlinexample3dev.blob.core.windows.net/" -> null
-       primary_blob_host                 = "johnlinexample3dev.blob.core.windows.net" -> null
-       primary_connection_string         = (sensitive value) -> null
-       primary_dfs_endpoint              = "https://johnlinexample3dev.dfs.core.windows.net/" -> null
-       primary_dfs_host                  = "johnlinexample3dev.dfs.core.windows.net" -> null
-       primary_file_endpoint             = "https://johnlinexample3dev.file.core.windows.net/" -> null
-       primary_file_host                 = "johnlinexample3dev.file.core.windows.net" -> null
-       primary_location                  = "northeurope" -> null
-       primary_queue_endpoint            = "https://johnlinexample3dev.queue.core.windows.net/" -> null
-       primary_queue_host                = "johnlinexample3dev.queue.core.windows.net" -> null
-       primary_table_endpoint            = "https://johnlinexample3dev.table.core.windows.net/" -> null
-       primary_table_host                = "johnlinexample3dev.table.core.windows.net" -> null
-       primary_web_endpoint              = "https://johnlinexample3dev.z16.web.core.windows.net/" -> null
-       primary_web_host                  = "johnlinexample3dev.z16.web.core.windows.net" -> null
-       queue_encryption_key_type         = "Service" -> null
-       resource_group_name               = "coop-rg" -> null
-       secondary_access_key              = (sensitive value) -> null
-       secondary_connection_string       = (sensitive value) -> null
-       shared_access_key_enabled         = true -> null
-       table_encryption_key_type         = "Service" -> null
-       tags                              = {
-           "environment" = "dev"
        } -> null
#        (3 unchanged attributes hidden)

-       blob_properties {
-           change_feed_enabled      = false -> null
-           last_access_time_enabled = false -> null
-           versioning_enabled       = false -> null
#            (1 unchanged attribute hidden)
        }

-       network_rules {
-           bypass                     = [
-               "AzureServices",
            ] -> null
-           default_action             = "Allow" -> null
-           ip_rules                   = [] -> null
-           virtual_network_subnet_ids = [] -> null
        }

-       queue_properties {
-           hour_metrics {
-               enabled               = true -> null
-               include_apis          = true -> null
-               retention_policy_days = 7 -> null
-               version               = "1.0" -> null
            }
-           logging {
-               delete                = false -> null
-               read                  = false -> null
-               retention_policy_days = 0 -> null
-               version               = "1.0" -> null
-               write                 = false -> null
            }
-           minute_metrics {
-               enabled               = false -> null
-               include_apis          = false -> null
-               retention_policy_days = 0 -> null
-               version               = "1.0" -> null
            }
        }

-       share_properties {
-           retention_policy {
-               days = 7 -> null
            }
        }
    }

  # module.stroage_account.azurerm_storage_container.example will be destroyed
  # (because azurerm_storage_container.example is not in configuration)
-   resource "azurerm_storage_container" "example" {
-       container_access_type   = "private" -> null
-       has_immutability_policy = false -> null
-       has_legal_hold          = false -> null
-       id                      = "https://johnlinexample3dev.blob.core.windows.net/example" -> null
-       metadata                = {} -> null
-       name                    = "example" -> null
-       resource_manager_id     = "/subscriptions/bd4b7a52-3576-4e08-81b6-fdbe7146cb7f/resourceGroups/coop-rg/providers/Microsoft.Storage/storageAccounts/johnlinexample3dev/blobServices/default/containers/example" -> null
-       storage_account_name    = "johnlinexample3dev" -> null
    }

Plan: 7 to add, 0 to change, 2 to destroy.

Warning: Deprecated Resource

  with module.function.azurerm_function_app.ml_model,
  on modules/function/function.tf line 9, in resource "azurerm_function_app" "ml_model":
   9: resource "azurerm_function_app" "ml_model" {

The `azurerm_function_app` resource has been superseded by the
`azurerm_linux_function_app` and `azurerm_windows_function_app` resources.
Whilst this resource will continue to be available in the 2.x and 3.x
releases it is feature-frozen for compatibility purposes, will no longer
receive any updates and will be removed in a future major release of the
Azure Provider.

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [PR Plan #11](https://github.com/JunzhongLin/johndemo3/actions/runs/13005288473)